import numpy as np
# 花式索引(Fancy indexing)指的是利用整数数组进行索引的方式。
array_two = np.array([[10, 20, 30],
                      [11, 21, 31],
                      [12, 22, 32],
                      [13, 23, 33],
                      [114, 124, 1242],
                      [121, 122, 123],
                      [110, 120, 130],
                      [130, 130, 134]])

# 找0 里的1，  找1里的2, 找4里的1， 5里的2
print(array_two[[0, 1, 4, 5], [1, 2, 1, 2]])

# 找0，1，4，5行的1，2列
print(array_two[np.ix_([0, 1, 4, 5], [1, 2])])

# 求3维qq