import numpy as np

arrayxx = np.array([[[111, 112, 113],
                     [121, 122, 123],
                     [131, 132, 133]],
                    [[211, 212, 213],
                     [221, 222, 223],
                     [231, 232, 233]],
                    [[311, 312, 313],
                     [321, 322, 323],
                     [331, 332, 333]]])
# 花式索引(Fancy indexing)指的是利用整数数组进行索引的方式。

# 花式索引不支持 :  来进行全维度来保留

print(arrayxx[[0], [1], [2]])
print(arrayxx[np.ix_([1], [2, 1], [-3, -2])])

arrayxy = np.arange(27).reshape(3, 3, 3)
print(arrayxy)


#一个四维的数组， 以后